pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_dpi_type.h
  struct {
    __IOM uint32_t dpi_post_pi_sel0 : 6;      /*!< [5..0] PLL phase select for mck_ck                                        */

    __IM  uint32_t            : 2;
    __IOM uint32_t dpi_post_pi_sel1 : 6;      /*!< [13..8] PLL phase select for mck_cmd                                      */

    __IM  uint32_t            : 2;
    __IOM uint32_t dpi_post_pi_sel2 : 6;      /*!< [21..16] PLL phase select for mck_dqs_0                                   */

    __IM  uint32_t            : 2;
    __IOM uint32_t dpi_post_pi_sel3 : 6;      /*!< [29..24] PLL phase select for mck_dqs_1                                   */
  } b;                                        /*!< bit fields for dpi_pll_pi0 */
} dpi_pll_pi0_t, *pdpi_pll_pi0_t;

/**
  \brief Union type to access dpi_pll_pi1 (@ 0x00000014).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000014) PLL PI1 Register                                           */

  struct {
    __IOM uint32_t dpi_post_pi_sel4 : 6;      /*!< [5..0] PLL phase select for mck_dqs_2                                     */

    __IM  uint32_t            : 2;
    __IOM uint32_t dpi_post_pi_sel5 : 6;      /*!< [13..8] PLL phase select for mck_dqs_3                                    */

    __IM  uint32_t            : 2;
    __IOM uint32_t dpi_post_pi_sel6 : 6;      /*!< [21..16] PLL phase select for mck_dq_0                                    */

    __IM  uint32_t            : 2;
    __IOM uint32_t dpi_post_pi_sel : 5;       /*!< [28..24] PLL internal clock phase select                                  */
  } b;                                        /*!< bit fields for dpi_pll_pi1 */
} dpi_pll_pi1_t, *pdpi_pll_pi1_t;

/**
  \brief Union type to access dpi_pll_pi2 (@ 0x00000018).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000018) PLL PI2 Register                                           */

  struct {
    __IOM uint32_t dpi_post_pi_sel7 : 6;      /*!< [5..0] PLL phase select for mck_dq_1                                      */

    __IM  uint32_t            : 2;
    __IOM uint32_t dpi_post_pi_sel8 : 6;      /*!< [13..8] PLL phase select for mck_dq_2                                     */

    __IM  uint32_t            : 2;
    __IOM uint32_t dpi_post_pi_sel9 : 6;      /*!< [21..16] PLL phase select for mck_dq_3                                    */

    __IM  uint32_t            : 2;
    __IOM uint32_t dpi_post_pi_sel10 : 6;     /*!< [29..24] PLL phase select for mck_ck_1                                    */
  } b;                                        /*!< bit fields for dpi_pll_pi2 */
} dpi_pll_pi2_t, *pdpi_pll_pi2_t;

/**
  \brief Union type to access dpi_pll_ctl3 (@ 0x0000001C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000001C) PLL Control Register 3                                     */

  struct {
    __IOM uint32_t dpi_cco_band : 2;          /*!< [1..0] CCO Band Select : 0 : 500M~850M 1 : 850M~1600M                     */
    __IOM uint32_t dpi_cco_kvco : 1;          /*!< [2..2] Kcco control 0:small Kcco 1:large Kcco (Default)                   */

    __IM  uint32_t            : 1;
    __IOM uint32_t dpi_icp    : 4;            /*!< [7..4] PLL Charge Pump Current Control                                    */
    __IOM uint32_t dpi_loop_pi_isel : 2;      /*!< [9..8] PLL PI bias current control                                        */
    __IOM uint32_t dpi_cco_sel : 1;           /*!< [10..10] dpi_cco_sel                                                      */

    __IM  uint32_t            : 1;
    __IOM uint32_t dpi_lpf_cp : 1;            /*!< [12..12] PLL Cp Control                                                   */
    __IOM uint32_t dpi_lpf_sr : 3;            /*!< [15..13] PLL Loop Filter Resister Control RS: 000 : 3K 001 :
                                                   6K 010 : 9K 011 : 12K 100 : 15K 101 : 18K 110 : 21K 111
                                                   : 24K                                                                     */
    __IOM uint32_t dpi_pdiv   : 2;            /*!< [17..16] PLL pre-divider 00 : Div1 01 : Div2 10 : Div3 11 :
                                                   Div4                                                                      */
    __IOM uint32_t dpi_pll_dbug_en : 1;       /*!< [18..18] PLL Debug enable 0 : disable 1 : enable                          */
    __IOM uint32_t dpi_v11_ldo_sel : 2;       /*!< [20..19] LDO output control : 00 : 1.6V 01 : 1.7V 10 : 1.8V
                                                   11 : 1.9V                                                                 */
    __IM  uint32_t            : 1;
    __IOM uint32_t dpi_post_pi_bias : 2;      /*!< [23..22] Post PI bias control                                             */
    __IOM uint32_t dpi_post_pi_rl : 2;        /*!< [25..24] Post PI RL control                                               */
    __IOM uint32_t dpi_post_pi_cl : 1;        /*!< [26..26] Post PI RS control                                               */
    __IOM uint32_t dpi_ckref_sel : 1;         /*!< [27..27] Ref Clock select                                                 */
    __IOM uint32_t dpi_vco_ldo_vsel : 2;      /*!< [29..28] pll vco ldo select                                               */

    __IM  uint32_t            : 1;
    __IOM uint32_t dpi_output_iso : 1;        /*!< [31..31] PLL isolation cell enable                                        */
  } b;                                        /*!< bit fields for dpi_pll_ctl3 */
} dpi_pll_ctl3_t, *pdpi_pll_ctl3_t;

/**
  \brief Union type to access dpi_ssc0 (@ 0x00000020).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000020) SSC0 Register                                              */

  struct {
    __IOM uint32_t dpi_bypass_pi : 1;         /*!< [0..0] When no fractional divider or SSC,bypass Phase Intepolator
                                                   for CMU loop 0: including PI inside the loop 1: bypass
                                                   PI inside the loop                                                        */
    __IOM uint32_t dpi_en_ssc : 1;            /*!< [1..1] Enable SSC function                                                */
    __IOM uint32_t dpi_order  : 1;            /*!< [2..2] not used                                                           */
    __IOM uint32_t dpi_sel_mode : 1;          /*!< [3..3] SSC mode selector                                                  */
    __IOM uint32_t dpi_en_center_in : 1;      /*!< [4..4] Enable center SSC no used for PCIe                                 */
    __IOM uint32_t dpi_weighting_sel : 3;     /*!< [7..5] not used                                                           */
    __IOM uint32_t dpi_step_in : 15;          /*!< [22..8] SSC profile per-step delta code                                   */
  } b;                                        /*!< bit fields for dpi_ssc0 */
} dpi_ssc0_t, *pdpi_ssc0_t;

/**
  \brief Union type to access dpi_ssc1 (@ 0x00000024).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000024) SSC1 Register                                              */

