pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_dpi_type.h
  struct {
    __IOM uint32_t dpi_f_code : 15;           /*!< [14..0] Fractional code of loop divider                                   */

    __IM  uint32_t            : 1;
    __IOM uint32_t dpi_tbase  : 12;           /*!< [27..16] SSC profile step number                                          */
  } b;                                        /*!< bit fields for dpi_ssc1 */
} dpi_ssc1_t, *pdpi_ssc1_t;

/**
  \brief Union type to access dpi_ssc2 (@ 0x00000028).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000028) SSC2 Register                                              */

  struct {
    __IOM uint32_t dpi_n_code : 8;            /*!< [7..0] Integer code of loop divider                                       */
    __IOM uint32_t dpi_vbg_sel : 3;           /*!< [10..8] PLL band gap voltage selection                                    */
    __IOM uint32_t dpi_bg_pow : 1;            /*!< [11..11] PLL band gap power                                               */
    __IOM uint32_t dpi_bg_bias : 2;           /*!< [13..12] PLL band gap bias control                                        */
  } b;                                        /*!< bit fields for dpi_ssc2 */
} dpi_ssc2_t, *pdpi_ssc2_t;

/**
  \brief Union type to access dpi_wdog (@ 0x00000030).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000030) Watch Dog Register                                         */

  struct {
    __IOM uint32_t dpi_wd_enable : 1;         /*!< [0..0] Enable watch dog function                                          */
    __IOM uint32_t dpi_f390k  : 2;            /*!< [2..1] F390K output delay, not used                                       */

    __IM  uint32_t            : 1;
    __IOM uint32_t dpi_time0_ck : 3;          /*!< [6..4] Watchdog timing control                                            */

    __IM  uint32_t            : 1;
    __IOM uint32_t dpi_time_rdy_ckout : 2;    /*!< [9..8] Clock ready timing control                                         */

    __IM  uint32_t            : 2;
    __IOM uint32_t dpi_time2_rst_width : 2;   /*!< [13..12] Reset timing ontrol                                              */
  } b;                                        /*!< bit fields for dpi_wdog */
} dpi_wdog_t, *pdpi_wdog_t;

/**
  \brief Union type to access dpi_ca_pupd0 (@ 0x00000034).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000034) CA_PUPD0 Register                                          */

  struct {
    __IM  uint32_t            : 8;
    __IOM uint32_t b00_pd     : 1;            /*!< [8..8] BANK0 PD                                                           */
    __IOM uint32_t b00_pu     : 1;            /*!< [9..9] BANK0 PU                                                           */
    __IOM uint32_t b01_pd     : 1;            /*!< [10..10] BANK1 PD                                                         */
    __IOM uint32_t b01_pu     : 1;            /*!< [11..11] BANK1 PU                                                         */
    __IOM uint32_t b02_pd     : 1;            /*!< [12..12] BANK2 PD                                                         */
    __IOM uint32_t b02_pu     : 1;            /*!< [13..13] BANK2 PU                                                         */
    __IOM uint32_t reset_pd   : 1;            /*!< [14..14] RESET PD                                                         */
    __IOM uint32_t reset_pu   : 1;            /*!< [15..15] RESET PU                                                         */
    __IOM uint32_t odt_pd     : 1;            /*!< [16..16] ODT PD                                                           */
    __IOM uint32_t odt_pu     : 1;            /*!< [17..17] ODT PU                                                           */
    __IOM uint32_t we_pd      : 1;            /*!< [18..18] WE PD                                                            */
    __IOM uint32_t we_pu      : 1;            /*!< [19..19] WE PU                                                            */
    __IOM uint32_t cas_pd     : 1;            /*!< [20..20] CAS PD                                                           */
    __IOM uint32_t cas_pu     : 1;            /*!< [21..21] CAS PU                                                           */
    __IOM uint32_t ras_pd     : 1;            /*!< [22..22] RAS PD                                                           */
    __IOM uint32_t ras_pu     : 1;            /*!< [23..23] RAS PU                                                           */
    __IOM uint32_t cs_pd      : 1;            /*!< [24..24] CS PD                                                            */
    __IOM uint32_t cs_pu      : 1;            /*!< [25..25] CS PU                                                            */
    __IOM uint32_t cke_pd     : 1;            /*!< [26..26] CKE PD                                                           */
    __IOM uint32_t cke_pu     : 1;            /*!< [27..27] CKE PU                                                           */
    __IOM uint32_t ck_n_pd    : 1;            /*!< [28..28] CKB PD                                                           */
    __IOM uint32_t ck_n_pu    : 1;            /*!< [29..29] CKB PU                                                           */
    __IOM uint32_t ck_p_pd    : 1;            /*!< [30..30] CK PD                                                            */
    __IOM uint32_t ck_p_pu    : 1;            /*!< [31..31] CK PU                                                            */
  } b;                                        /*!< bit fields for dpi_ca_pupd0 */
} dpi_ca_pupd0_t, *pdpi_ca_pupd0_t;

/**
  \brief Union type to access dpi_ca_pupd1 (@ 0x00000038).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000038) CA_PUPD1 Register                                          */

  struct {
    __IOM uint32_t a00_pd     : 1;            /*!< [0..0] A0 PD                                                              */
    __IOM uint32_t a00_pu     : 1;            /*!< [1..1] A0 PU                                                              */
    __IOM uint32_t a01_pd     : 1;            /*!< [2..2] A1 PD                                                              */
    __IOM uint32_t a01_pu     : 1;            /*!< [3..3] A1 PU                                                              */
    __IOM uint32_t a02_pd     : 1;            /*!< [4..4] A2 PD                                                              */
    __IOM uint32_t a02_pu     : 1;            /*!< [5..5] A2 PU                                                              */
    __IOM uint32_t a03_pd     : 1;            /*!< [6..6] A3 PD                                                              */
    __IOM uint32_t a03_pu     : 1;            /*!< [7..7] A3 PU                                                              */
    __IOM uint32_t a04_pd     : 1;            /*!< [8..8] A4 PD                                                              */
    __IOM uint32_t a04_pu     : 1;            /*!< [9..9] A4 PU                                                              */
    __IOM uint32_t a05_pd     : 1;            /*!< [10..10] A5 PD                                                            */
    __IOM uint32_t a05_pu     : 1;            /*!< [11..11] A5 PU                                                            */
    __IOM uint32_t a06_pd     : 1;            /*!< [12..12] A6 PD                                                            */
    __IOM uint32_t a06_pu     : 1;            /*!< [13..13] A6 PU                                                            */
    __IOM uint32_t a07_pd     : 1;            /*!< [14..14] A7 PD                                                            */
    __IOM uint32_t a07_pu     : 1;            /*!< [15..15] A7 PU                                                            */
    __IOM uint32_t a08_pd     : 1;            /*!< [16..16] A8 PD                                                            */
    __IOM uint32_t a08_pu     : 1;            /*!< [17..17] A8 PU                                                            */
    __IOM uint32_t a09_pd     : 1;            /*!< [18..18] A9 PD                                                            */
    __IOM uint32_t a09_pu     : 1;            /*!< [19..19] A9 PU                                                            */
    __IOM uint32_t a10_pd     : 1;            /*!< [20..20] A10 PD                                                           */
    __IOM uint32_t a10_pu     : 1;            /*!< [21..21] A10 PU                                                           */
    __IOM uint32_t a11_pd     : 1;            /*!< [22..22] A11 PD                                                           */
    __IOM uint32_t a11_pu     : 1;            /*!< [23..23] A11 PU                                                           */
    __IOM uint32_t a12_pd     : 1;            /*!< [24..24] A12 PD                                                           */
    __IOM uint32_t a12_pu     : 1;            /*!< [25..25] A12 PU                                                           */
    __IOM uint32_t a13_pd     : 1;            /*!< [26..26] A13 PD                                                           */
    __IOM uint32_t a13_pu     : 1;            /*!< [27..27] A13 PU                                                           */
    __IOM uint32_t a14_pd     : 1;            /*!< [28..28] A14 PD                                                           */
    __IOM uint32_t a14_pu     : 1;            /*!< [29..29] A14 PU                                                           */
    __IOM uint32_t a15_pd     : 1;            /*!< [30..30] A15 PD                                                           */
    __IOM uint32_t a15_pu     : 1;            /*!< [31..31] A15 PU                                                           */
  } b;                                        /*!< bit fields for dpi_ca_pupd1 */
} dpi_ca_pupd1_t, *pdpi_ca_pupd1_t;

/**
  \brief Union type to access dpi_dq_pupd (@ 0x0000003C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000003C) DQ_PUPD Register                                           */

