pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_dpi_type.h
  struct {
    __IOM uint32_t adr4_ext_dly_sel : 4;      /*!< [3..0] Extent address[4] delay chain control                              */
    __IOM uint32_t adr5_ext_dly_sel : 4;      /*!< [7..4] Extent address[5] delay chain control                              */
    __IOM uint32_t ba0_dly_sel : 4;           /*!< [11..8] BANK[0] delay chain control                                       */
    __IOM uint32_t ba1_dly_sel : 4;           /*!< [15..12] BANK[1] delay chain control                                      */
    __IOM uint32_t ba2_dly_sel : 4;           /*!< [19..16] BANK[2] delay chain control                                      */
  } b;                                        /*!< bit fields for dpi_adr_dly2 */
} dpi_adr_dly2_t, *pdpi_adr_dly2_t;

/**
  \brief Union type to access dpi_cmd_dly0 (@ 0x0000020C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000020C) CMD_DLY_0 Register                                         */

  struct {
    __IOM uint32_t cke_dly_sel : 4;           /*!< [3..0] CKE delay chain control                                            */
    __IOM uint32_t ras_n_dly_sel : 4;         /*!< [7..4] RAS_N delay chain control                                          */
    __IOM uint32_t cas_n_dly_sel : 4;         /*!< [11..8] CAS_N delay chain control                                         */
    __IOM uint32_t we_n_dly_sel : 4;          /*!< [15..12] WE_N delay chain control                                         */
    __IOM uint32_t odt_dly_sel : 4;           /*!< [19..16] ODT delay chain control                                          */
    __IOM uint32_t cs_n_dly_sel : 6;          /*!< [25..20] CS_N delay chain control                                         */
    __IOM uint32_t cs_n_1_dly_sel : 6;        /*!< [31..26] CS_N_1 delay chain control                                       */
  } b;                                        /*!< bit fields for dpi_cmd_dly0 */
} dpi_cmd_dly0_t, *pdpi_cmd_dly0_t;

/**
  \brief Union type to access dpi_pad_oe_ctl (@ 0x00000210).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000210) PAD_OE_CTL Register                                        */

  struct {
    __IOM uint32_t adr00_oe   : 1;            /*!< [0..0] Ouput enable of address[00]                                        */
    __IOM uint32_t adr01_oe   : 1;            /*!< [1..1] Ouput enable of address[01]                                        */
    __IOM uint32_t adr02_oe   : 1;            /*!< [2..2] Ouput enable of address[02]                                        */
    __IOM uint32_t adr03_oe   : 1;            /*!< [3..3] Ouput enable of address[03]                                        */
    __IOM uint32_t adr04_oe   : 1;            /*!< [4..4] Ouput enable of address[04]                                        */
    __IOM uint32_t adr05_oe   : 1;            /*!< [5..5] Ouput enable of address[05]                                        */
    __IOM uint32_t adr06_oe   : 1;            /*!< [6..6] Ouput enable of address[06]                                        */
    __IOM uint32_t adr07_oe   : 1;            /*!< [7..7] Ouput enable of address[07]                                        */
    __IOM uint32_t adr08_oe   : 1;            /*!< [8..8] Ouput enable of address[08]                                        */
    __IOM uint32_t adr09_oe   : 1;            /*!< [9..9] Ouput enable of address[09]                                        */
    __IOM uint32_t adr10_oe   : 1;            /*!< [10..10] Ouput enable of address[10]                                      */
    __IOM uint32_t adr11_oe   : 1;            /*!< [11..11] Ouput enable of address[11]                                      */
    __IOM uint32_t adr12_oe   : 1;            /*!< [12..12] Ouput enable of address[12]                                      */
    __IOM uint32_t adr13_oe   : 1;            /*!< [13..13] Ouput enable of address[13]                                      */
    __IOM uint32_t adr14_oe   : 1;            /*!< [14..14] Ouput enable of address[14]                                      */
    __IOM uint32_t adr15_oe   : 1;            /*!< [15..15] Ouput enable of address[15]                                      */
    __IOM uint32_t ext_adr4_oe : 1;           /*!< [16..16] Ouput enable of Extent address[4]                                */
    __IOM uint32_t ext_adr5_oe : 1;           /*!< [17..17] Ouput enable of Extent address[5]                                */
    __IOM uint32_t bk0_oe     : 1;            /*!< [18..18] Ouput enable of BANK[0]                                          */
    __IOM uint32_t bk1_oe     : 1;            /*!< [19..19] Ouput enable of BANK[1]                                          */
    __IOM uint32_t bk2_oe     : 1;            /*!< [20..20] Ouput enable of BANK[2]                                          */
    __IOM uint32_t reset_n_oe : 1;            /*!< [21..21] Ouput enable of Reset_N                                          */
    __IOM uint32_t odt_oe     : 1;            /*!< [22..22] Ouput enable of ODT                                              */
    __IOM uint32_t we_n_oe    : 1;            /*!< [23..23] Ouput enable of WE_N                                             */
    __IOM uint32_t cas_n_oe   : 1;            /*!< [24..24] Ouput enable of CAS_N                                            */
    __IOM uint32_t ras_n_oe   : 1;            /*!< [25..25] Ouput enable of RAS_N                                            */
    __IOM uint32_t cke_oe     : 1;            /*!< [26..26] Ouput enable of CKE                                              */
    __IOM uint32_t cs_n_oe    : 1;            /*!< [27..27] Output enable of DCS_N                                           */
    __IOM uint32_t cs_n_1_oe  : 1;            /*!< [28..28] Output enable of DCS_N_1                                         */
    __IOM uint32_t dck_oe     : 1;            /*!< [29..29] Ouput enable of DCK                                              */
    __IOM uint32_t dck_1_oe   : 1;            /*!< [30..30] Output enable of DCK_1                                           */
    __IOM uint32_t adr54_1to1 : 1;            /*!< [31..31] Address[5:4] OCD control                                         */
  } b;                                        /*!< bit fields for dpi_pad_oe_ctl */
} dpi_pad_oe_ctl_t, *pdpi_pad_oe_ctl_t;

/**
  \brief Union type to access dpi_wrlvl_ctrl (@ 0x00000228).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000228) WRLVL_CTRL Register                                        */

