pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_dpi_type.h
  struct {
    __IOM uint32_t dq0_dly_sel : 4;           /*!< [3..0] DQ[0] delay chain control                                          */
    __IOM uint32_t dq1_dly_sel : 4;           /*!< [7..4] DQ[1] delay chain control                                          */
    __IOM uint32_t dq2_dly_sel : 4;           /*!< [11..8] DQ[2] delay chain control                                         */
    __IOM uint32_t dq3_dly_sel : 4;           /*!< [15..12] DQ[3] delay chain control                                        */
    __IOM uint32_t dq4_dly_sel : 4;           /*!< [19..16] DQ[4] delay chain control                                        */
    __IOM uint32_t dq5_dly_sel : 4;           /*!< [23..20] DQ[5] delay chain control                                        */
    __IOM uint32_t dq6_dly_sel : 4;           /*!< [27..24] DQ[6] delay chain control                                        */
    __IOM uint32_t dq7_dly_sel : 4;           /*!< [31..28] DQ[7] delay chain control                                        */
  } b;                                        /*!< bit fields for dpi_dq_dly0_1 */
} dpi_dq_dly0_1_t, *pdpi_dq_dly0_1_t;

/**
  \brief Union type to access dpi_dq_dly0_2 (@ 0x00000240).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000240) DQ_DLY Register 0_2                                        */

  struct {
    __IOM uint32_t dq0_dly_sel : 4;           /*!< [3..0] DQ[0] delay chain control                                          */
    __IOM uint32_t dq1_dly_sel : 4;           /*!< [7..4] DQ[1] delay chain control                                          */
    __IOM uint32_t dq2_dly_sel : 4;           /*!< [11..8] DQ[2] delay chain control                                         */
    __IOM uint32_t dq3_dly_sel : 4;           /*!< [15..12] DQ[3] delay chain control                                        */
    __IOM uint32_t dq4_dly_sel : 4;           /*!< [19..16] DQ[4] delay chain control                                        */
    __IOM uint32_t dq5_dly_sel : 4;           /*!< [23..20] DQ[5] delay chain control                                        */
    __IOM uint32_t dq6_dly_sel : 4;           /*!< [27..24] DQ[6] delay chain control                                        */
    __IOM uint32_t dq7_dly_sel : 4;           /*!< [31..28] DQ[7] delay chain control                                        */
  } b;                                        /*!< bit fields for dpi_dq_dly0_2 */
} dpi_dq_dly0_2_t, *pdpi_dq_dly0_2_t;

/**
  \brief Union type to access dpi_dq_dly0_3 (@ 0x00000244).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000244) DQ_DLY Register 0_3                                        */

  struct {
    __IOM uint32_t dq0_dly_sel : 4;           /*!< [3..0] DQ[0] delay chain control                                          */
    __IOM uint32_t dq1_dly_sel : 4;           /*!< [7..4] DQ[1] delay chain control                                          */
    __IOM uint32_t dq2_dly_sel : 4;           /*!< [11..8] DQ[2] delay chain control                                         */
    __IOM uint32_t dq3_dly_sel : 4;           /*!< [15..12] DQ[3] delay chain control                                        */
    __IOM uint32_t dq4_dly_sel : 4;           /*!< [19..16] DQ[4] delay chain control                                        */
    __IOM uint32_t dq5_dly_sel : 4;           /*!< [23..20] DQ[5] delay chain control                                        */
    __IOM uint32_t dq6_dly_sel : 4;           /*!< [27..24] DQ[6] delay chain control                                        */
    __IOM uint32_t dq7_dly_sel : 4;           /*!< [31..28] DQ[7] delay chain control                                        */
  } b;                                        /*!< bit fields for dpi_dq_dly0_3 */
} dpi_dq_dly0_3_t, *pdpi_dq_dly0_3_t;

/**
  \brief Union type to access dpi_dq_dly1 (@ 0x00000248).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000248) DQ_DLY Register 1                                          */

  struct {
    __IOM uint32_t dqs_dly_sel_0 : 4;         /*!< [3..0] Slice0 DQS delay chain control                                     */
    __IOM uint32_t dm_dly_sel_0 : 4;          /*!< [7..4] Slice0 DM delay chain control                                      */
    __IOM uint32_t dqs_dly_sel_1 : 4;         /*!< [11..8] Slice1 DQS delay chain control                                    */
    __IOM uint32_t dm_dly_sel_1 : 4;          /*!< [15..12] Slice1 DM delay chain control                                    */
    __IOM uint32_t dqs_dly_sel_2 : 4;         /*!< [19..16] Slice2 DQS delay chain control                                   */
    __IOM uint32_t dm_dly_sel_2 : 4;          /*!< [23..20] Slice2 DM delay chain control                                    */
    __IOM uint32_t dqs_dly_sel_3 : 4;         /*!< [27..24] Slice3 DQS delay chain control                                   */
    __IOM uint32_t dm_dly_sel_3 : 4;          /*!< [31..28] Slice3 DM delay chain control                                    */
  } b;                                        /*!< bit fields for dpi_dq_dly1 */
} dpi_dq_dly1_t, *pdpi_dq_dly1_t;

/**
  \brief Union type to access dpi_dq_dly2 (@ 0x0000024C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000024C) DQ_DLY Register 2                                          */

  struct {
    __IOM uint32_t dqs_oe_dly_sel_0 : 4;      /*!< [3..0] Slice0 DQS output enable delay chain control                       */
    __IOM uint32_t dqs_oe_dly_sel_1 : 4;      /*!< [7..4] Slice1 DQS output enable delay chain control                       */
    __IOM uint32_t dqs_oe_dly_sel_2 : 4;      /*!< [11..8] Slice2 DQS output enable delay chain control                      */
    __IOM uint32_t dqs_oe_dly_sel_3 : 4;      /*!< [15..12] Slice3 DQS output enable delay chain control                     */
  } b;                                        /*!< bit fields for dpi_dq_dly2 */
} dpi_dq_dly2_t, *pdpi_dq_dly2_t;

/**
  \brief Union type to access dpi_read_ctrl0_0 (@ 0x00000254).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000254) Read Control Register 0_0                                  */

