pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_dpi_type.h
  struct {
    __IOM uint32_t tm_dqs_en  : 5;            /*!< [4..0] dqs_en latency from read command                                   */

    __IM  uint32_t            : 3;
    __IOM uint32_t dqs_en_dly_sel : 6;        /*!< [13..8] dqs_en delay chain control                                        */
    __IOM uint32_t dqs_fifo_dly_sel : 2;      /*!< [15..14] dqs clock to read FIFO delay control                             */
    __IOM uint32_t dqs_det_dly_sel : 4;       /*!< [19..16] dqs_det delay control                                            */
    __IOM uint32_t dqs_rclin_dly_sel : 5;     /*!< [24..20] dqs clock to receive_1st delay control                           */
  } b;                                        /*!< bit fields for dpi_read_ctrl0_0 */
} dpi_read_ctrl0_0_t, *pdpi_read_ctrl0_0_t;

/**
  \brief Union type to access dpi_read_ctrl0_1 (@ 0x00000258).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000258) Read Control Register 0_1                                  */

  struct {
    __IOM uint32_t tm_dqs_en  : 5;            /*!< [4..0] dqs_en latency from read command                                   */

    __IM  uint32_t            : 3;
    __IOM uint32_t dqs_en_dly_sel : 6;        /*!< [13..8] dqs_en delay chain control                                        */
    __IOM uint32_t dqs_fifo_dly_sel : 2;      /*!< [15..14] dqs clock to read FIFO delay control                             */
    __IOM uint32_t dqs_det_dly_sel : 4;       /*!< [19..16] dqs_det delay control                                            */
    __IOM uint32_t dqs_rclin_dly_sel : 5;     /*!< [24..20] dqs clock to receive_1st delay control                           */
  } b;                                        /*!< bit fields for dpi_read_ctrl0_1 */
} dpi_read_ctrl0_1_t, *pdpi_read_ctrl0_1_t;

/**
  \brief Union type to access dpi_read_ctrl1 (@ 0x00000264).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000264) Read Control Register 1                                    */

  struct {
    __IOM uint32_t tm_rd_fifo : 5;            /*!< [4..0] read FIFO latency from read command                                */

    __IM  uint32_t            : 3;
    __IOM uint32_t dq_lat_en_force_sig : 1;   /*!< [8..8] If set dq_lat_en_force_sel, dq latch enable is controlled
                                                   by dq_lat_en_force_sig.                                                   */
    __IOM uint32_t dq_lat_en_force_sel : 1;   /*!< [9..9] dq latch control                                                   */
    __IOM uint32_t rd_dly_follow_dq0 : 1;     /*!< [10..10] When this field is set to 1, FW can program read delay
                                                   chain setting by dq0                                                      */
    __IOM uint32_t dqsen_cal_en : 1;          /*!< [11..11] DQS enable calibration                                           */
    __IOM uint32_t dqsen_cal_sel : 6;         /*!< [17..12] Central point of DQS enable calibratio                           */
    __IOM uint32_t dqsen_cal_pre_sel : 4;     /*!< [21..18] Left point of DQS enable calibration                             */
    __IOM uint32_t dqsen_cal_pos_sel : 4;     /*!< [25..22] Right of DQS enable calibration                                  */
  } b;                                        /*!< bit fields for dpi_read_ctrl1 */
} dpi_read_ctrl1_t, *pdpi_read_ctrl1_t;

/**
  \brief Union type to access dpi_read_ctrl2_0 (@ 0x00000268).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000268) Read Control Register 2_0                                  */

  struct {
    __IOM uint32_t tm_odt_en  : 22;           /*!< [21..0] odt_en when read delay                                            */
    __IOM uint32_t odt_force_sig : 1;         /*!< [22..22] If set odt_force_sel, TE is controlled by odt_force_sig.         */
    __IOM uint32_t odt_force_sel : 1;         /*!< [23..23] ODT pad control.                                                 */
  } b;                                        /*!< bit fields for dpi_read_ctrl2_0 */
} dpi_read_ctrl2_0_t, *pdpi_read_ctrl2_0_t;

/**
  \brief Union type to access dpi_read_ctrl2_1 (@ 0x0000026C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000026C) Read Control Register 2_1                                  */

  struct {
    __IOM uint32_t tm_odt_en  : 22;           /*!< [21..0] odt_en when read delay                                            */
    __IOM uint32_t odt_force_sig : 1;         /*!< [22..22] If set odt_force_sel, TE is controlled by odt_force_sig.         */
    __IOM uint32_t odt_force_sel : 1;         /*!< [23..23] ODT pad control.                                                 */
  } b;                                        /*!< bit fields for dpi_read_ctrl2_1 */
} dpi_read_ctrl2_1_t, *pdpi_read_ctrl2_1_t;

/**
  \brief Union type to access dpi_dqs_in_dly_0 (@ 0x000002B8).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002B8) DQS In Delay Register 0                                    */

  struct {
    __IOM uint32_t fw_rd_dly_pos_sel_0 : 5;   /*!< [4..0] DQS_IN[0] raising edge delay chain control                         */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_1 : 5;   /*!< [12..8] DQS_IN[1] raising edge delay chain control                        */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_2 : 5;   /*!< [20..16] DQS_IN[2] raising edge delay chain control                       */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_3 : 5;   /*!< [28..24] DQS_IN[3] raising edge delay chain control                       */
  } b;                                        /*!< bit fields for dpi_dqs_in_dly_0 */
} dpi_dqs_in_dly_0_t, *pdpi_dqs_in_dly_0_t;

/**
  \brief Union type to access dpi_dqs_in_dly_0_1 (@ 0x000002BC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002BC) DQS In Delay Register 0_1                                  */

