pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_dpi_type.h
  struct {
    __IOM uint32_t fw_rd_dly_pos_sel_0 : 5;   /*!< [4..0] DQS_IN[0] raising edge delay chain control                         */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_1 : 5;   /*!< [12..8] DQS_IN[1] raising edge delay chain control                        */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_2 : 5;   /*!< [20..16] DQS_IN[2] raising edge delay chain control                       */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_3 : 5;   /*!< [28..24] DQS_IN[3] raising edge delay chain control                       */
  } b;                                        /*!< bit fields for dpi_dqs_in_dly_0_1 */
} dpi_dqs_in_dly_0_1_t, *pdpi_dqs_in_dly_0_1_t;

/**
  \brief Union type to access dpi_dqs_in_dly_0_2 (@ 0x000002C0).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002C0) DQS In Delay Register 0_2                                  */

  struct {
    __IOM uint32_t fw_rd_dly_pos_sel_0 : 5;   /*!< [4..0] DQS_IN[0] raising edge delay chain control                         */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_1 : 5;   /*!< [12..8] DQS_IN[1] raising edge delay chain control                        */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_2 : 5;   /*!< [20..16] DQS_IN[2] raising edge delay chain control                       */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_3 : 5;   /*!< [28..24] DQS_IN[3] raising edge delay chain control                       */
  } b;                                        /*!< bit fields for dpi_dqs_in_dly_0_2 */
} dpi_dqs_in_dly_0_2_t, *pdpi_dqs_in_dly_0_2_t;

/**
  \brief Union type to access dpi_dqs_in_dly_0_3 (@ 0x000002C4).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002C4) DQS In Delay Register 0_3                                  */

  struct {
    __IOM uint32_t fw_rd_dly_pos_sel_0 : 5;   /*!< [4..0] DQS_IN[0] raising edge delay chain control                         */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_1 : 5;   /*!< [12..8] DQS_IN[1] raising edge delay chain control                        */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_2 : 5;   /*!< [20..16] DQS_IN[2] raising edge delay chain control                       */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_3 : 5;   /*!< [28..24] DQS_IN[3] raising edge delay chain control                       */
  } b;                                        /*!< bit fields for dpi_dqs_in_dly_0_3 */
} dpi_dqs_in_dly_0_3_t, *pdpi_dqs_in_dly_0_3_t;

/**
  \brief Union type to access dpi_dqs_in_dly_1 (@ 0x000002C8).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002C8) DQS In Delay Register 1                                    */

  struct {
    __IOM uint32_t fw_rd_dly_pos_sel_4 : 5;   /*!< [4..0] DQS_IN[4] raising edge delay chain control                         */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_5 : 5;   /*!< [12..8] DQS_IN[5] raising edge delay chain control                        */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_6 : 5;   /*!< [20..16] DQS_IN[6] raising edge delay chain control                       */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_7 : 5;   /*!< [28..24] DQS_IN[7] raising edge delay chain control                       */
  } b;                                        /*!< bit fields for dpi_dqs_in_dly_1 */
} dpi_dqs_in_dly_1_t, *pdpi_dqs_in_dly_1_t;

/**
  \brief Union type to access dpi_dqs_in_dly_1_1 (@ 0x000002CC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002CC) DQS In Delay Register 1_1                                  */

  struct {
    __IOM uint32_t fw_rd_dly_pos_sel_4 : 5;   /*!< [4..0] DQS_IN[4] raising edge delay chain control                         */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_5 : 5;   /*!< [12..8] DQS_IN[5] raising edge delay chain control                        */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_6 : 5;   /*!< [20..16] DQS_IN[6] raising edge delay chain control                       */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_7 : 5;   /*!< [28..24] DQS_IN[7] raising edge delay chain control                       */
  } b;                                        /*!< bit fields for dpi_dqs_in_dly_1_1 */
} dpi_dqs_in_dly_1_1_t, *pdpi_dqs_in_dly_1_1_t;

/**
  \brief Union type to access dpi_dqs_in_dly_1_2 (@ 0x000002D0).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002D0) DQS In Delay Register 1_2                                  */

  struct {
    __IOM uint32_t fw_rd_dly_pos_sel_4 : 5;   /*!< [4..0] DQS_IN[4] raising edge delay chain control                         */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_5 : 5;   /*!< [12..8] DQS_IN[5] raising edge delay chain control                        */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_6 : 5;   /*!< [20..16] DQS_IN[6] raising edge delay chain control                       */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_7 : 5;   /*!< [28..24] DQS_IN[7] raising edge delay chain control                       */
  } b;                                        /*!< bit fields for dpi_dqs_in_dly_1_2 */
} dpi_dqs_in_dly_1_2_t, *pdpi_dqs_in_dly_1_2_t;

/**
  \brief Union type to access dpi_dqs_in_dly_1_3 (@ 0x000002D4).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002D4) DQS In Delay Register 1_3                                  */

  struct {
    __IOM uint32_t fw_rd_dly_pos_sel_4 : 5;   /*!< [4..0] DQS_IN[4] raising edge delay chain control                         */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_5 : 5;   /*!< [12..8] DQS_IN[5] raising edge delay chain control                        */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_6 : 5;   /*!< [20..16] DQS_IN[6] raising edge delay chain control                       */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_pos_sel_7 : 5;   /*!< [28..24] DQS_IN[7] raising edge delay chain control                       */
  } b;                                        /*!< bit fields for dpi_dqs_in_dly_1_3 */
} dpi_dqs_in_dly_1_3_t, *pdpi_dqs_in_dly_1_3_t;

/**
  \brief Union type to access dpi_dqs_in_dly_2 (@ 0x000002D8).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002D8) DQS In Delay Register 2                                    */

