pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_dpi_type.h
  struct {
    __IOM uint32_t fw_rd_dly_neg_sel_0 : 5;   /*!< [4..0] DQS_IN[0] falling edge delay chain control                         */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_1 : 5;   /*!< [12..8] DQS_IN[1] falling edge delay chain control                        */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_2 : 5;   /*!< [20..16] DQS_IN[2] falling edge delay chain control                       */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_3 : 5;   /*!< [28..24] DQS_IN[3] falling edge delay chain control                       */
  } b;                                        /*!< bit fields for dpi_dqs_in_dly_2 */
} dpi_dqs_in_dly_2_t, *pdpi_dqs_in_dly_2_t;

/**
  \brief Union type to access dpi_dqs_in_dly_2_1 (@ 0x000002DC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002DC) DQS In Delay Register 2_1                                  */

  struct {
    __IOM uint32_t fw_rd_dly_neg_sel_0 : 5;   /*!< [4..0] DQS_IN[0] falling edge delay chain control                         */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_1 : 5;   /*!< [12..8] DQS_IN[1] falling edge delay chain control                        */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_2 : 5;   /*!< [20..16] DQS_IN[2] falling edge delay chain control                       */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_3 : 5;   /*!< [28..24] DQS_IN[3] falling edge delay chain control                       */
  } b;                                        /*!< bit fields for dpi_dqs_in_dly_2_1 */
} dpi_dqs_in_dly_2_1_t, *pdpi_dqs_in_dly_2_1_t;

/**
  \brief Union type to access dpi_dqs_in_dly_2_2 (@ 0x000002E0).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002E0) DQS In Delay Register 2_2                                  */

  struct {
    __IOM uint32_t fw_rd_dly_neg_sel_0 : 5;   /*!< [4..0] DQS_IN[0] falling edge delay chain control                         */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_1 : 5;   /*!< [12..8] DQS_IN[1] falling edge delay chain control                        */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_2 : 5;   /*!< [20..16] DQS_IN[2] falling edge delay chain control                       */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_3 : 5;   /*!< [28..24] DQS_IN[3] falling edge delay chain control                       */
  } b;                                        /*!< bit fields for dpi_dqs_in_dly_2_2 */
} dpi_dqs_in_dly_2_2_t, *pdpi_dqs_in_dly_2_2_t;

/**
  \brief Union type to access dpi_dqs_in_dly_2_3 (@ 0x000002E4).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002E4) DQS In Delay Register 2_3                                  */

  struct {
    __IOM uint32_t fw_rd_dly_neg_sel_0 : 5;   /*!< [4..0] DQS_IN[0] falling edge delay chain control                         */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_1 : 5;   /*!< [12..8] DQS_IN[1] falling edge delay chain control                        */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_2 : 5;   /*!< [20..16] DQS_IN[2] falling edge delay chain control                       */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_3 : 5;   /*!< [28..24] DQS_IN[3] falling edge delay chain control                       */
  } b;                                        /*!< bit fields for dpi_dqs_in_dly_2_3 */
} dpi_dqs_in_dly_2_3_t, *pdpi_dqs_in_dly_2_3_t;

/**
  \brief Union type to access dpi_dqs_in_dly_3 (@ 0x000002E8).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002E8) DQS In Delay Register 3                                    */

  struct {
    __IOM uint32_t fw_rd_dly_neg_sel_4 : 5;   /*!< [4..0] DQS_IN[4] falling edge delay chain control                         */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_5 : 5;   /*!< [12..8] DQS_IN[5] falling edge delay chain control                        */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_6 : 5;   /*!< [20..16] DQS_IN[6] falling edge delay chain control                       */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_7 : 5;   /*!< [28..24] DQS_IN[7] falling edge delay chain control                       */
  } b;                                        /*!< bit fields for dpi_dqs_in_dly_3 */
} dpi_dqs_in_dly_3_t, *pdpi_dqs_in_dly_3_t;

/**
  \brief Union type to access dpi_dqs_in_dly_3_1 (@ 0x000002EC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002EC) DQS In Delay Register 3_1                                  */

  struct {
    __IOM uint32_t fw_rd_dly_neg_sel_4 : 5;   /*!< [4..0] DQS_IN[4] falling edge delay chain control                         */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_5 : 5;   /*!< [12..8] DQS_IN[5] falling edge delay chain control                        */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_6 : 5;   /*!< [20..16] DQS_IN[6] falling edge delay chain control                       */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_7 : 5;   /*!< [28..24] DQS_IN[7] falling edge delay chain control                       */
  } b;                                        /*!< bit fields for dpi_dqs_in_dly_3_1 */
} dpi_dqs_in_dly_3_1_t, *pdpi_dqs_in_dly_3_1_t;

/**
  \brief Union type to access dpi_dqs_in_dly_3_2 (@ 0x000002F0).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002F0) DQS In Delay Register 3_2                                  */

  struct {
    __IOM uint32_t fw_rd_dly_neg_sel_4 : 5;   /*!< [4..0] DQS_IN[4] falling edge delay chain control                         */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_5 : 5;   /*!< [12..8] DQS_IN[5] falling edge delay chain control                        */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_6 : 5;   /*!< [20..16] DQS_IN[6] falling edge delay chain control                       */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_7 : 5;   /*!< [28..24] DQS_IN[7] falling edge delay chain control                       */
  } b;                                        /*!< bit fields for dpi_dqs_in_dly_3_2 */
} dpi_dqs_in_dly_3_2_t, *pdpi_dqs_in_dly_3_2_t;

/**
  \brief Union type to access dpi_dqs_in_dly_3_3 (@ 0x000002F4).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002F4) DQS In Delay Register 3_3                                  */

