pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_dpi_type.h
  struct {
    __IOM uint32_t fw_rd_dly_neg_sel_4 : 5;   /*!< [4..0] DQS_IN[4] falling edge delay chain control                         */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_5 : 5;   /*!< [12..8] DQS_IN[5] falling edge delay chain control                        */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_6 : 5;   /*!< [20..16] DQS_IN[6] falling edge delay chain control                       */

    __IM  uint32_t            : 3;
    __IOM uint32_t fw_rd_dly_neg_sel_7 : 5;   /*!< [28..24] DQS_IN[7] falling edge delay chain control                       */
  } b;                                        /*!< bit fields for dpi_dqs_in_dly_3_3 */
} dpi_dqs_in_dly_3_3_t, *pdpi_dqs_in_dly_3_3_t;

/**
  \brief Union type to access dpi_dqs_p_pad_ctrl (@ 0x00000324).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000324) DQS P Pad Control Register                                 */

  struct {
    __IOM uint32_t ne         : 3;            /*!< [2..0] Driving control                                                    */

    __IM  uint32_t            : 1;
    __IOM uint32_t pe         : 3;            /*!< [6..4] Driving control                                                    */

    __IM  uint32_t            : 3;
    __IOM uint32_t smt        : 1;            /*!< [10..10] Schmitt trigger                                                  */

    __IM  uint32_t            : 1;
    __IOM uint32_t ttcn       : 4;            /*!< [15..12] On die termination control                                       */
    __IOM uint32_t ttcp       : 4;            /*!< [19..16] On die termination control                                       */
  } b;                                        /*!< bit fields for dpi_dqs_p_pad_ctrl */
} dpi_dqs_p_pad_ctrl_t, *pdpi_dqs_p_pad_ctrl_t;

/**
  \brief Union type to access dpi_dpi_ctrl0 (@ 0x0000037C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000037C) DPI Control Register 0                                     */

  struct {
    __IOM uint32_t fw_set_mode : 2;           /*!< [1..0] FW set delay chain of data slice mode                              */
    __IOM uint32_t rst_fifo_mode : 2;         /*!< [3..2] Reset read FIFO pointer mode                                       */
    __IOM uint32_t cal_set_mode : 2;          /*!< [5..4] 3-point calibration set mode                                       */
    __IOM uint32_t dqsen_mode : 2;            /*!< [7..6] Generate DQS enable mode                                           */
    __IOM uint32_t ref_update_dly : 6;        /*!< [13..8] Update delay chain setting after receiving refresh command        */
    __IOM uint32_t ref_cmd_sel : 1;           /*!< [14..14] DDR command swap, when ref_cmd_sel == 1                          */

    __IM  uint32_t            : 1;
    __IOM uint32_t rd_update_dly : 5;         /*!< [20..16] Update delay chain setting after read data enable                */
    __IOM uint32_t wr_update_dly : 3;         /*!< [23..21] Update delay chain setting after write data enable               */
    __IOM uint32_t cmd_ph_en  : 1;            /*!< [24..24] Command output delay enable                                      */
    __IOM uint32_t cmd_ph_sel : 3;            /*!< [27..25] Command output delay                                             */
  } b;                                        /*!< bit fields for dpi_dpi_ctrl0 */
} dpi_dpi_ctrl0_t, *pdpi_dpi_ctrl0_t;

/**
  \brief Union type to access dpi_dpi_ctrl1 (@ 0x00000380).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000380) DPI Control Register 1                                     */

  struct {
    __IOM uint32_t fw_set_wr_dly : 1;         /*!< [0..0] FW set write delay chain of data slice                             */

    __OM  uint32_t write_en_0 : 1;            /*!< [1..1] Enable of the following row                                        */
    __OM  uint32_t fw_set_rd_dly : 1;         /*!< [2..2] FW set read delay chain of data slice                              */
    __OM  uint32_t write_en_1 : 1;            /*!< [3..3] Enable of the following row                                        */
    __OM  uint32_t fw_set_cal_range : 1;      /*!< [4..4] FW set 3-point calibration range                                   */
    __OM  uint32_t write_en_2 : 1;            /*!< [5..5] Enable of the following row                                        */
    __OM  uint32_t fw_set_rd_det : 1;         /*!< [6..6] FW set read delay chain of valid window detection                  */
    __OM  uint32_t write_en_3 : 1;            /*!< [7..7] Enable of the following row                                        */
  } b;                                        /*!< bit fields for dpi_dpi_ctrl1 */
} dpi_dpi_ctrl1_t, *pdpi_dpi_ctrl1_t;

/**
  \brief Union type to access dpi_bist_2to1_0 (@ 0x000003D8).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000003D8) bist 2to1 Register 0                                       */

  struct {
    __IOM uint32_t bist_debug_sel : 5;        /*!< [4..0] debug selection                                                    */

    __IM  uint32_t            : 15;
    __IOM uint32_t bist_mode  : 3;            /*!< [22..20] Bist mode                                                        */
    __IOM uint32_t bist_en    : 1;            /*!< [23..23] Enable bist circuit in PHY                                       */
    __IOM uint32_t b_2to1_wrlv_delay_0 : 1;   /*!< [24..24] slice0 add one cycle delay for write leveling                    */
    __IOM uint32_t b_2to1_wrlv_delay_1 : 1;   /*!< [25..25] slice1 add one cycle delay for write leveling                    */
    __IOM uint32_t b_2to1_wrlv_delay_2 : 1;   /*!< [26..26] slice2 add one cycle delay for write leveling                    */
    __IOM uint32_t b_2to1_wrlv_delay_3 : 1;   /*!< [27..27] slice3 add one cycle delay for write leveling                    */
    __IOM uint32_t b_2to1_en_dq : 1;          /*!< [28..28] For data slice                                                   */
    __IOM uint32_t b_2to1_wrdelay : 1;        /*!< [29..29] add one cycle delay for write command                            */
    __IOM uint32_t b_2to1_rddelay : 1;        /*!< [30..30] add one cycle delay for read command                             */
    __IOM uint32_t b_2to1_en_adr : 1;         /*!< [31..31] For address and command slice                                    */
  } b;                                        /*!< bit fields for dpi_bist_2to1_0 */
} dpi_bist_2to1_0_t, *pdpi_bist_2to1_0_t;

/**
  \brief Union type to access dpi_int_ctrl (@ 0x000003E8).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000003E8) Init Control Register                                      */

