pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_dpi_type.h
  struct {
    __IOM uint32_t int_dqs_en : 1;            /*!< [0..0] dqs_int enable                                                     */

    __OM  uint32_t write_en_0 : 1;            /*!< [1..1] Enable of the following row                                        */
    __IOM uint32_t int_cal_bdy_en : 1;        /*!< [2..2] cal_bdy_int enable                                                 */

    __OM  uint32_t write_en_1 : 1;            /*!< [3..3] Enable of the following row                                        */
    __IOM uint32_t fw_clr_dqs_int : 1;        /*!< [4..4] FW clear dqs_int (one cycle pulse, HW auto clear)                  */

    __OM  uint32_t write_en_2 : 1;            /*!< [5..5] Enable of the following row                                        */
    __IOM uint32_t int_cpu_0_en : 1;          /*!< [6..6] To CPU 0 interrupt enable                                          */

    __OM  uint32_t write_en_3 : 1;            /*!< [7..7] Enable of the following row                                        */
    __IOM uint32_t int_cpu_1_en : 1;          /*!< [8..8] To CPU 1 interrupt enable                                          */

    __OM  uint32_t write_en_4 : 1;            /*!< [9..9] Enable of the following row                                        */
    __IOM uint32_t int_cpu_2_en : 1;          /*!< [10..10] To CPU 2 interrupt enable                                        */

    __OM  uint32_t write_en_5 : 1;            /*!< [11..11] Enable of the following row                                      */
    __IOM uint32_t int_cpu_3_en : 1;          /*!< [12..12] To CPU 3 interrupt enable                                        */

    __OM  uint32_t write_en_6 : 1;            /*!< [13..13] Enable of the following row                                      */
    __IOM uint32_t int_pll_en : 1;            /*!< [14..14] Enable PLL stable interrupt                                      */

    __OM  uint32_t write_en_7 : 1;            /*!< [15..15] Enable of the following row                                      */
    __IM  uint32_t            : 4;
    __IOM uint32_t int_2to1_en : 1;           /*!< [20..20] Enable 2to1 read fail interrupt                                  */

    __OM  uint32_t write_en_10 : 1;           /*!< [21..21] Enable of the following row                                      */
    __IM  uint32_t            : 2;
    __IOM uint32_t int_fifo_ptr__en : 1;      /*!< [24..24] fifo_prt_int enable                                              */

    __OM  uint32_t write_en_12 : 1;           /*!< [25..25] Enable of the following row                                      */
  } b;                                        /*!< bit fields for dpi_int_ctrl */
} dpi_int_ctrl_t, *pdpi_int_ctrl_t;

/**
  \brief Union type to access dpi_int_status_0 (@ 0x000003EC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000003EC) Init Status Register 0                                     */

  struct {
    __IOM uint32_t dqs_int_0  : 1;            /*!< [0..0] dqs_int of data slice0                                             */
    __IOM uint32_t dqs_int_1  : 1;            /*!< [1..1] dqs_int of data slice1                                             */
    __IOM uint32_t dqs_int_2  : 1;            /*!< [2..2] dqs_int of data slice2                                             */
    __IOM uint32_t dqs_int_3  : 1;            /*!< [3..3] dqs_int of data slice3                                             */
  } b;                                        /*!< bit fields for dpi_int_status_0 */
} dpi_int_status_0_t, *pdpi_int_status_0_t;

/** @} */ /* End of group hs_hal_dpi_reg */
/// @endcond /* End of condition DOXYGEN_GENERAL_REG_TYPE || DOXYGEN_DPI_REG_TYPE */


#ifdef  __cplusplus
}
#endif

#endif    // end of #ifndef _RTL8710C_DPI_TYPE_H_

